app/Controllers/Dashboard.php

SELECT *
FROM `institutions`
---
    public function index(): string
    {
        $data['title'] = 'dashboard';

         // load all institution data
         $institution_db = new InstitutionModel();
         $data['institution_data'] = $institution_db->findAll();