app/Controllers/InstitutionController.php

SELECT *
FROM `institutions`
WHERE `id` = 'dashboard.js'
 LIMIT 1
---
    public function edit_institution_profile($id)
    {
        $institution_db = new InstitutionModel();
        $data = [];
        $record  = $institution_db->where('id', $id)->first();