app/Models/IdCardModel.php

    public function select_id_card_label_by_group(){
        $query = $this->db->table('idcard_qrcodes')
        ->select('COUNT(idcard_qrcodes.label) as total')
        ->select('idcard_qrcodes.*')
        ->select('institutions.*')
        ->join('institutions', 'idcard_qrcodes.institutionId = institutions.id')
        ->groupBy('idcard_qrcodes.groupId')
        ->get();
---
SELECT COUNT(idcard_qrcodes.label) as total, `idcard_qrcodes`.*, `institutions`.*
FROM `idcard_qrcodes`
JOIN `institutions` ON `idcard_qrcodes`.`institutionId` = `institutions`.`id`
GROUP BY `idcard_qrcodes`.`groupId`

    public function getIdCardDataByUnqid($unqid)
    {
        return $this->select('idcard_qrcodes.*, institutions.*')
            ->join('institutions', 'idcard_qrcodes.institutionId = institutions.id')
            ->where('idcard_qrcodes.unqId', $unqid)
            ->first(); // You can use findOne() if you expect a single row
---
SELECT `idcard_qrcodes`.*, `institutions`.*
FROM `idcard_qrcodes`
JOIN `institutions` ON `idcard_qrcodes`.`institutionId` = `institutions`.`id`
WHERE `idcard_qrcodes`.`unqId` = '2XuWQ'
 LIMIT 1