app/Models/ReportCardModel.php

    public function select_report_card_label_by_group(){
        $query = $this->db->table('reportcard_qrcodes')
        ->select('COUNT(reportcard_qrcodes.label) as total')
        ->select('reportcard_qrcodes.*')
        ->select('institutions.*')
        ->join('institutions', 'reportcard_qrcodes.institutionId = institutions.id')
        ->groupBy('reportcard_qrcodes.groupId')
        ->get();
---
SELECT COUNT(reportcard_qrcodes.label) as total, `reportcard_qrcodes`.*, `institutions`.*
FROM `reportcard_qrcodes`
JOIN `institutions` ON `reportcard_qrcodes`.`institutionId` = `institutions`.`id`
GROUP BY `reportcard_qrcodes`.`groupId`